УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаСборку/ЗаказНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаСборку</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений/ДоступныеОстаткиПланируемыхПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="daf8dd54-80ee-41d9-a8d1-409533bcac1a">
  <name>ДоступныеОстаткиПланируемыхПоступлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f0877c5a-96ab-41aa-b1ec-aaedf8abeed8">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="8473b6d2-c972-4ac9-8e68-4a1614f32769">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7c3b211d-ef93-4cd9-838b-848fbbd49bb9">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="09190e01-0557-47ca-9397-2ba761cd1562">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7a919b8d-94eb-4b87-8751-d2561646f501">
    <name>ДатаДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаСборку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей	
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения); 
		
	#Вставка
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
	//-- #1989 смарт: Лопато 15.08.2024
	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования") Тогда
		
		//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявка", ДанныеЗаполнения);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура
		|ПОМЕСТИТЬ НоменклатураОборудование
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента
		|ГДЕ
		|	Сегмент.смартИдентификаторДляФормул = ""СегментАппаратноеОбеспечение""	
		|; 
		|////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура, Серия, Склад, 
		|	КРазборкеОстаток КАК Количество,
		|	КРазборкеОстаток КАК КоличествоУпаковок			
		|ИЗ
		|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
		|		,
		|		Заявка = &Заявка 
		|		И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ НоменклатураОборудование)
		|	)
		|; 
		|////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура,
		|	ВЫБОР
		|		КОГДА Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ НоменклатураОборудование) 
		|		ТОГДА Серия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Серия,
		|	КПолучениюОстаток КАК Количество,
		|	КПолучениюОстаток КАК КоличествоУпаковок		
		|ИЗ
		|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
		|		,
		|		Заявка = &Заявка
		|	)
		|";
		ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = ПакетРезультатовЗапроса[1].Выбрать();
		Если Не Выборка.Следующий() Тогда
			
			// Выслать нахер
			Возврат;
			
		КонецЕсли;
		
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, Подразделение");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Склад, Номенклатура, Серия, Количество, КоличествоУпаковок");
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров;
		
		ЭтотОбъект.Товары.Загрузить(ПакетРезультатовЗапроса[2].Выгрузить());
		//-- #1901 смарт: Ермаков 21.08.2024
		
	#КонецВставки
		
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения));
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
			ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.смартЗапчастиГарантийные;
		КонецЕсли;
	КонецЕсли;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки

КонецПроцедуры //-- #1646 смарт: Мосолов 20.02.2024 

//++ смарт:ММ #059 327 02.08.2020 - Перенос даты резерва, спр. Грузы
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");

	ПараметрыСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаСборку);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыСерий);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	ПараметрыОкругления = ОбщегоНазначенияУТ.ПараметрыОкругленияКоличестваШтучныхТоваров();
	ПараметрыОкругления.ИмяТЧ = "Объект";
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления);

	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	#Удаление
	ШаблонНазначения = Документы.ЗаказНаСборку.ШаблонНазначения(ЭтотОбъект);
	ПерегенерацияНазначения = Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(
	?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров, НазначениеТовары, Назначение),
	ШаблонНазначения, ЭтотОбъект, "НаправлениеДеятельности", Отказ);
	#КонецУдаления
	#Вставка
	//++ #Б2934 смарт: Шляпников 01.04.2025 / Заявка на разборку оборудования. Дополнение. Последующие разборки.
	Если НЕ ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования") ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
		
		ШаблонНазначения = Документы.ЗаказНаСборку.ШаблонНазначения(ЭтотОбъект);
		ПерегенерацияНазначения = Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(
									?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров, НазначениеТовары, Назначение),
									ШаблонНазначения, ЭтотОбъект, "НаправлениеДеятельности", Отказ);
									
	Иначе
									
		ПерегенерацияНазначения = Ложь;
		
		Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
			ЭтотОбъект.Назначение = ЭтотОбъект.ДокументОснование.Назначение;
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б2934 смарт: Шляпников 01.04.2025
	#КонецВставки

	Если ПерегенерацияНазначения Тогда
		ОбосабливатьПоНазначениюЗаказа = Константы.ВариантОбособленияТоваровВСборке.Получить()
		<> Перечисления.ВариантыОбособленияТоваровВСборке.НазначениеСобираемогоКомплекта;
	КонецЕсли;  
	
	#Вставка
	
	//++ смарт:КМД #2_4 327 01.02.2021
	//++ смарт:ММ #059 327 02.08.2020 - Перенос даты резерва, спр. Грузы 
	//проверка на новый документ и на факт проведения
	Если ЗначениеЗаполнено(Ссылка) И РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		// Проверка, изменились ли даты начала и окончания сборки
		
		ДатыДоИзмененияСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "НачалоСборкиРазборки, ОкончаниеСборкиРазборки");
		
		Если ДатыДоИзмененияСтруктура.ОкончаниеСборкиРазборки <> ЭтотОбъект.ОкончаниеСборкиРазборки тогда
			
			ДополнительныеСвойства.Вставить("смартИзмениласьДатаПоступленияДокумента", Истина);
			
			ТаблицаИзменившихсяДатПоступления = смартСтруктураТаблицыИзменилисьДаты();
			
			Если ЭтотОбъект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СборкаТоваров") тогда
				//в этом проверяем собранный товар из шапки
				НовСтр = ТаблицаИзменившихсяДатПоступления.Добавить();
				НовСтр.Номенклатура = ЭтотОбъект.Номенклатура;
				НовСтр.Характеристика = ЭтотОбъект.Характеристика;
				НовСтр.ДатаПоступления = ЭтотОбъект.ОкончаниеСборкиРазборки;
				НовСтр.Количество = ЭтотОбъект.Количество;
				НовСтр.Склад = ЭтотОбъект.Склад;
				НовСтр.ДатаПоступленияНачальная = ДатыДоИзмененияСтруктура.ОкончаниеСборкиРазборки;
			Иначе
				//разборка товаров
				//проверяем разобранный товар из ТЧ Товары
				Для каждого стр из ЭтотОбъект.Товары цикл
					НовСтр = ТаблицаИзменившихсяДатПоступления.Добавить();
					НовСтр.Номенклатура = стр.Номенклатура;
					НовСтр.Характеристика = стр.Характеристика;
					НовСтр.ДатаПоступления = ЭтотОбъект.ОкончаниеСборкиРазборки;
					НовСтр.Количество = стр.Количество;
					НовСтр.Склад = ЭтотОбъект.Склад;
					НовСтр.ДатаПоступленияНачальная = ДатыДоИзмененияСтруктура.ОкончаниеСборкиРазборки;
				КонецЦикла;
			КонецЕсли;
			
			ДополнительныеСвойства.Вставить("смартТаблицаИзменившихсяДатПоступления", ТаблицаИзменившихсяДатПоступления);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++ смарт:КМД #2_4 327 24.12.2020
	//сбор таблицы для проверки отрицательных остатков
	Если ДополнительныеСвойства.Свойство("смартНеПроверятьДоступныеОстаткиПланируемыхПоступлений") = Ложь тогда
		
		//++ смарт:Демичев №1133 28.09.2022
		Если ЭтотОбъект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СборкаТоваров") тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаказНаСборку.Номенклатура КАК Номенклатура,
			|	ЗаказНаСборку.Характеристика КАК Характеристика,
			|	ЗаказНаСборку.Склад КАК Склад
			|ИЗ
			|	Документ.ЗаказНаСборку КАК ЗаказНаСборку
			|ГДЕ
			|	ЗаказНаСборку.Ссылка = &Ссылка";
			
			ТаблицаДляПроверкиОтрицательныхОстатков = Запрос.Выполнить().Выгрузить();
			ДополнительныеСвойства.Вставить("смартТаблицаДляПроверкиОтрицательныхОстатков", ТаблицаДляПроверкиОтрицательныхОстатков);
			
		Иначе//++ смарт:Демичев №1133 28.09.2022((В результате разборки на комплектующие
			
			//сбор таблицы для проверки отрицательных остатков по ТЧ
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаказНаСборкуТовары.Номенклатура КАК Номенклатура,
			|	ЗаказНаСборкуТовары.Характеристика КАК Характеристика,
			|	ЗаказНаСборкуТовары.Ссылка.Склад КАК Склад
			|ИЗ
			|	Документ.ЗаказНаСборку.Товары КАК ЗаказНаСборкуТовары
			|ГДЕ
			|	ЗаказНаСборкуТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказНаСборкуТовары.Характеристика,
			|	ЗаказНаСборкуТовары.Номенклатура,
			|	ЗаказНаСборкуТовары.Ссылка.Склад";
			
			ТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель = Запрос.Выполнить().Выгрузить();
			ДополнительныеСвойства.Вставить("смартТаблицаДляПроверкиОтрицательныхОстатковТовары", ТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель);
			
		КонецЕсли;
		//-- смарт:Демичев №1133 28.09.2022
	КонецЕсли; 
	
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования	
	// Отключил ниже 
	
	//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей 
	
	//Если ЭтоНовый() Тогда  
	//	
	//	Если ЗначениеЗаполнено(Номенклатура) 
	//		И Номенклатура.ВидНоменклатуры = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение
	//		И Номенклатура.ВидНоменклатуры.ИспользоватьСерии 
	//		И (Не ЗначениеЗаполнено(ДокументОснование) 
	//			ИЛИ НЕ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")) Тогда
	//		
	//		ТипДокумента = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров, "сборки", "разборки");
	//		ТекстСообщения = "Для " + ТипДокумента + " оборудования необходимо обязательно делать документ на основании Заявки на ремонтные работы"; 
	//		
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);  
	//		
	//	КонецЕсли;   
	//	
	//КонецЕсли;
	
	//-- #1646 смарт: Мосолов 20.02.2024 
	//-- #1901 смарт: Ермаков 21.08.2024
	
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Добавление заказа для расчета состояний необходимо для тех случаев когда, например, для всех товаров указан способ
	// обеспечения "Не обеспечивать". При таком способе обеспечения документ не делает движений по тем регистрам, которые
	// добавили бы заказ для расчета самостоятельно.
	ПроведениеСерверУТ.ДобавитьЗаказДляРасчетаСостояний(ДополнительныеСвойства, Ссылка);

	#Удаление
	ШаблонНазначения = Документы.ЗаказНаСборку.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПриЗаписиДокумента(
	?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров, НазначениеТовары, Назначение),
	ШаблонНазначения, ЭтотОбъект, Склад, СборкаПодДеятельность);
	#КонецУдаления
	#Вставка
	//++ #Б2934 смарт: Шляпников 01.04.2025 / Заявка на разборку оборудования. Дополнение. Последующие разборки.
	Если НЕ ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования") ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
		
		ШаблонНазначения = Документы.ЗаказНаСборку.ШаблонНазначения(ЭтотОбъект);
		Справочники.Назначения.ПриЗаписиДокумента(
										?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров, НазначениеТовары, Назначение),
										ШаблонНазначения, ЭтотОбъект, Склад, СборкаПодДеятельность);
									
	КонецЕсли;
	//-- #Б2934 смарт: Шляпников 01.04.2025
	#КонецВставки

	Если Не Отказ
		И Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		РегистрыСведений.РеестрДокументов.ИнициализироватьИЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	КонецЕсли;

	// При отмене проведения или установке пометки на удаление проведенного документа необходим вызов пересчета состояний,
	// для удаления записи по текущему документу из регистра сведений СостоянияВнутреннихЗаказов. Корректный пересчет
	// состояния возможен в том случае, когда у документа уже установлен (записан) признак Проведен = Ложь.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #2_4 327 24.12.2020
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ЗаказНаСборку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗаказыСервер.ОтразитьЗаказыНаСборку(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьГрафикОтгрузкиТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования	
	смартСборкаРазборкаОборудованияСервер.ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	СформироватьСписокРегистровДляКонтроля();

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ,, Ссылка);
	КонецЕсли;
    //-- #1901 смарт: Ермаков 21.08.2024
	
	//++ смарт:КМД #2_4 327 01.02.2021
	Если ДополнительныеСвойства.Свойство("смартИзмениласьДатаПоступленияДокумента")
		И ДополнительныеСвойства.смартИзмениласьДатаПоступленияДокумента = Истина Тогда
		
		смарт_ПеренестиДатыПлановойОтгрузкиВЗаказахКлиента();
		//++ смарт:КМД #2_4 327 24.12.2020
		//проверка на отрицательные остатки по регистру ДоступныеОстаткиПланируемыхПоступлений, если в документе не менялись даты поступлений
		//если менялись дату поступлений, то в регистре будут отрицательные остаткии, проверка не имеет смысла
		//еще учитываем что плановые даты поступлений двигаются приоритетно через справочник грузы, значит остальные реквизиты при этом измениться не могут
		//тут 2 вариант реализации:
		//1. инициировать проверку на отрицательные остатки только когда документы не двигаются (если документы сдвинули, а проведение заказа поставщику отменили, то и документы не надо было сдвигать, иначе вообще будут некоректные данные в регистрах)
		//2. Изменять связанные документы в транзации, после изменения проверять на отрицательные остатки и при ошибке отменять транзакцию. НО! Если связанные документ не перепроведется, то надо и не проводить заказ поставщику, что не правильно
	Иначе
		Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда
			//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
			//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
			//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ, Истина);
			смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,Истина);
			//-- #1333 смарт: Фролов 28.03.2023
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатковТовары") тогда
			//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
			//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
			//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ, Истина);
			смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковТовары,Отказ,Истина,Истина);
			//-- #1333 смарт: Фролов 28.03.2023
		КонецЕсли;
		
		//-- смарт:КМД #2_4 327 24.12.2020
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры

//++ смарт:КМД #2_4 327 01.02.2021
&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования	
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ, Истина, Ссылка);
	КонецЕсли;
	//-- #1901 смарт: Ермаков 21.08.2024
	
	//++ смарт:КМД #2_4 327 01.02.2021
	//проверка по складу получателю
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ);
		смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,Ложь);
		//-- #1333 смарт: Фролов 28.03.2023
	КонецЕсли;
	
	//проверка по складу отправителю
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатковТовары") тогда
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковТовары, Отказ);
		смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковТовары,Отказ,Ложь,Истина);
		//-- #1333 смарт: Фролов 28.03.2023
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	Массив.Добавить(Движения.ОбеспечениеЗаказов);

	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Массив.Добавить(Движения.ЗаказыНаСборку);
	КонецЕсли;

	ПараметрыУказанияСерий =  НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаСборку);
	// Контроль выполняется при перепроведении, отмене проведения или если используются серии, чтобы проверить возможность
	// резервирования серий.
	Если Не ДополнительныеСвойства.ЭтоНовый
		Или ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры
		Или ПараметрыУказанияСерий.Шапка.ИспользоватьСерииНоменклатуры Тогда
		Массив.Добавить(Движения.ТоварыКОтгрузке);
	КонецЕсли;

	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Массив.Добавить(Движения.СвободныеОстатки);
		Массив.Добавить(Движения.ГрафикОтгрузкиТоваров);
	КонецЕсли;

	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Массив.Добавить(Движения.смартОборудованиеКРазборке);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ смарт:КМД #2_4 327 01.02.2021
Функция смартСтруктураТаблицыИзменилисьДаты()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("ДатаПоступления", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("ДатаПоступленияНачальная", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	Возврат ТЗ;
КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_ПеренестиДатыПлановойОтгрузкиВЗаказахКлиента()
	ТаблицаИзменившихсяДатПоступления = Неопределено;
	Если ДополнительныеСвойства.Свойство("смартТаблицаИзменившихсяДатПоступления", ТаблицаИзменившихсяДатПоступления) И
		ЗначениеЗаполнено(ТаблицаИзменившихсяДатПоступления) тогда
		
		МассивТиповДокументов = смарт_ПолучитьМассивТиповСдвинутьДокументы();
		
		Для каждого стр из ТаблицаИзменившихсяДатПоступления цикл
			//проверка наличия отрицательных остатков в регистре сведений ДоступныеОстаткиПланируемыхПоступлений
			
			//дата поступления сдвинулась вперед, возможно образовался отрицательный остаток
			Если стр.ДатаПоступления > стр.ДатаПоступленияНачальная тогда
				ОтрицательныйОстаток = смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(стр.Номенклатура, стр.Характеристика, стр.Склад);
				
				Если ОтрицательныйОстаток < 0 тогда
					смарт_СдвинутьДокументыОтгрузки(стр.Номенклатура, стр.Характеристика, стр.Склад, МассивТиповДокументов, Истина, Ложь);
				КонецЕсли;
			//дата поступления сдвинулась вперед, отрицательный остаток не образовывается, но необходимо даты связанные документов тоже сдвинуть назад
			ИначеЕсли стр.ДатаПоступления < стр.ДатаПоступленияНачальная тогда
				смарт_СдвинутьДокументыОтгрузки(стр.Номенклатура, стр.Характеристика, стр.Склад, МассивТиповДокументов, Истина, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_ПолучитьМассивТиповСдвинутьДокументы()
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаСборку"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	
	Возврат Массив;
КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(Номенклатура, Характеристика, Склад)
	ОтрицательныйОстаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ДоступныеОстаткиПланируемыхПоступлений.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ДоступныеОстаткиПланируемыхПоступлений
	|ГДЕ
	|	ДоступныеОстаткиПланируемыхПоступлений.Номенклатура = &Номенклатура
	|	И ДоступныеОстаткиПланируемыхПоступлений.Характеристика = &Характеристика
	|	И ДоступныеОстаткиПланируемыхПоступлений.Склад = &Склад
	|	И ДоступныеОстаткиПланируемыхПоступлений.Количество < 0
	|	И ДоступныеОстаткиПланируемыхПоступлений.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.Количество) тогда
			ОтрицательныйОстаток = Выборка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтрицательныйОстаток;

КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_ТекстЗапросаГрафики()
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПоступленияТоваровОбороты.ДатаСобытия КАК ДатаСобытия,
	|	ГрафикПоступленияТоваровОбороты.КоличествоИзЗаказовПриход КАК КоличествоПоступление
	|ИЗ
	|	РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ГрафикПоступленияТоваровОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОтгрузкиТоваровОбороты.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход КАК КоличествоОтгрузка,
	|	ГрафикОтгрузкиТоваровОбороты.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ГрафикОтгрузкиТоваровОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки
	|";

	
	Возврат Текст;

КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, Склад, МассивТиповДокументов, СдвигатьРекурсивноЗаказыНаПеремещение, СдвигатьНазад)

	//найдем таблица по графикам отгрузки и поступления
	//распланируем даты отгрузки в зависимости от дат поступления
	
	Запрос = Новый Запрос;
	Запрос.Текст = смарт_ТекстЗапросаГрафики();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТЗГрафикПоступления = МассивРезультатов[0].Выгрузить();
	ТЗГрафикОтгрузки = МассивРезультатов[1].Выгрузить();
	
	ТЗГрафикОтгрузки.Колонки.Добавить("ДатаСдвига", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	//для каждого документа из ТЗГрафикОтгрузки найдем даты, на которые надо перенести документ для того, чтобы график был корректным
	//разбивка строк в документах графика отгрузки не предусмотрена согласно условиям задачи!
	Для каждого стр_отгрузка из ТЗГрафикОтгрузки цикл
		КоличествоОтгрузка = стр_отгрузка.КоличествоОтгрузка;
		ДатаОтгрузки = стр_отгрузка.ДатаОтгрузки;
		
		//найдем соответсвующую строку графика поступления
		КоличествоГрафикПриемки = 0; //для поиска строк
		
		ДатаСдвига = Дата("00010101000000");
		
		Для каждого стр_поступление из ТЗГрафикПоступления цикл
			КоличествоГрафикПриемки = КоличествоГрафикПриемки + стр_поступление.КоличествоПоступление;
			Если КоличествоОтгрузка <= КоличествоГрафикПриемки тогда
				ДатаСдвига = стр_поступление.ДатаСобытия;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//обработка таблицы ТЗГрафикПоступления, удаляем уже "занятые" количества
		МассивСтрокУдалить = Новый Массив;
		ОсталосьРаспределить = КоличествоОтгрузка;
		Для каждого стр_поступление из ТЗГрафикПоступления цикл
			Если ОсталосьРаспределить <= 0 тогда
				Прервать;
			КонецЕсли;
			
			РаспределитьТекущаяИтерация = Мин(стр_поступление.КоличествоПоступление, ОсталосьРаспределить);
			
			стр_поступление.КоличествоПоступление = стр_поступление.КоличествоПоступление - РаспределитьТекущаяИтерация;
			ОсталосьРаспределить = ОсталосьРаспределить - РаспределитьТекущаяИтерация;
			
			Если стр_поступление.КоличествоПоступление = 0 тогда
				МассивСтрокУдалить.Добавить(стр_поступление);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСтрокУдалить.Количество() > 0 тогда
			Для каждого стр_удалить из МассивСтрокУдалить цикл
				ТЗГрафикПоступления.Удалить(стр_удалить);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаСдвига) тогда
			//нашли дату сдвига
			Если СдвигатьНазад = Истина тогда
				Если НачалоДня(ДатаСдвига) < НачалоДня(ДатаОтгрузки) тогда
					//в этом случае надо сдвигать дату в документе отгрузки
					стр_отгрузка.ДатаСдвига = ДатаСдвига;
				КонецЕсли;
			Иначе
				Если НачалоДня(ДатаСдвига) > НачалоДня(ДатаОтгрузки) тогда
					//в этом случае надо сдвигать дату в документе отгрузки
					стр_отгрузка.ДатаСдвига = ДатаСдвига;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//по наличию дат сдвигов сдвигаем документы
	//поддерживается сдвиг следующий документов:
	//1. ЗаказКлиента
	//2. ЗаказНаПеремещение
	//3. ЗаказНаСборку
	//4. ЗаказНаВнутреннееПотребление
	
	МассивИзмененныхЗаказовНаПеремещение = Новый Массив;
	
	Для каждого стр_отгрузка из ТЗГрафикОтгрузки цикл
		Если ЗначениеЗаполнено(стр_отгрузка.ДатаСдвига) тогда
			смарт_СдвинутьДокументИзменениеДокумента(МассивТиповДокументов, стр_отгрузка.Документ, стр_отгрузка.ДатаСдвига, Номенклатура, Характеристика, Склад, МассивИзмененныхЗаказовНаПеремещение);
		КонецЕсли;
	КонецЦикла;
	
	//рекурсивно сдвигаем даты "подчиненных" документов по складам получателям в заказах на перемещение
	//глубина вложенности - 1, то есть если будет несколько перемещений (Склад 1 - Склад 2 - Склад 3 - Заказ клипента склад 3), то заказ клиента исправлен не будет
	Если СдвигатьРекурсивноЗаказыНаПеремещение = Истина тогда
		Для каждого ЗаказНаПеремещение из МассивИзмененныхЗаказовНаПеремещение цикл
			СкладПеремещение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказНаПеремещение, "СкладПолучатель");
			Если ЗначениеЗаполнено(СкладПеремещение) тогда
				Если СдвигатьНазад = Истина тогда
					смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, СкладПеремещение, МассивТиповДокументов, Ложь, СдвигатьНазад);
				Иначе
					ОтрицательныйОстаток = смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(Номенклатура, Характеристика, СкладПеремещение);
					Если ОтрицательныйОстаток < 0 тогда
						смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, СкладПеремещение, МассивТиповДокументов, Ложь, СдвигатьНазад);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_СдвинутьДокументИзменениеДокумента(МассивТиповДокументов, Док, ДатаСдвига, Номенклатура, Характеристика, Склад, МассивИзмененныхЗаказовНаПеремещение)
	ТипДок = ТипЗнч(Док);
	
	Если МассивТиповДокументов.Найти(ТипДок) <> Неопределено тогда
		//меняем данные в документах и проводим
		Об = Док.ПолучитьОбъект();
		
		Попытка
			Об.Заблокировать();
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Строка(Док) + " не возможно изменить, он заблокирован: " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		ОбъектИзменен = Ложь;
		
		Если ТипДок = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ
			ТипДок = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") тогда
			//отгрузить одной датой
			Если Об.НеОтгружатьЧастями = Истина тогда
				//если заказ отгружается одной датой, то снимаем этот признак, для того чтобы подвинуть дату по конкретному товару
				Об.НеОтгружатьЧастями = Ложь;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Номенклатура);
			Отбор.Вставить("Характеристика", Характеристика);
			Если ТипДок = Тип("ДокументСсылка.ЗаказКлиента") тогда
				Отбор.Вставить("Склад", Склад);
			КонецЕсли;
			Отбор.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов")); //резервировать к дате
			
			МассивСтрок = Об.Товары.НайтиСтроки(Отбор);
			Для каждого стр из МассивСтрок цикл
				стр.ДатаОтгрузки = ДатаСдвига;
				ОбъектИзменен = Истина;
			КонецЦикла;
		ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказНаСборку") тогда
			Об.НачалоСборкиРазборки = ДатаСдвига;
			Об.ОкончаниеСборкиРазборки = ДатаСдвига;
				
			ОбъектИзменен = Истина;
		ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказНаПеремещение") тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Номенклатура);
			Отбор.Вставить("Характеристика", Характеристика);
			Отбор.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов")); //резервировать к дате
			
			МассивСтрок = Об.Товары.НайтиСтроки(Отбор);
			Для каждого стр из МассивСтрок цикл
				стр.НачалоОтгрузки = ДатаСдвига;
				ОбъектИзменен = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если ОбъектИзменен Тогда
			//++ КМД 01.02.2021
			//добавим доп. свойство для отмены проверки на отрицательные остатки по регистру ДоступныеОстаткиПланируемыхПоступлений
			Об.ДополнительныеСвойства.Вставить("смартНеПроверятьДоступныеОстаткиПланируемыхПоступлений", Истина);
			
			Попытка
				Об.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменены даты резерва в документе """ + Строка(Док) + """", Док);
				
				НомерПоследнейВерсии = смартПолучитьНомерВерсииПоследний(Док);
				Если НомерПоследнейВерсии <> Неопределено Тогда
					ВерсионированиеОбъектов.ДобавитьКомментарийКВерсии(Док, НомерПоследнейВерсии, "Автоматический перенос резерва при изменении даты поступления товара");
				КонецЕсли;
				
				Если ТипДок = Тип("ДокументСсылка.ЗаказНаПеремещение") тогда
					МассивИзмененныхЗаказовНаПеремещение.Добавить(Док);
				КонецЕсли;
			Исключение				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ """ + Строка(Док) + """ не записан: " + ОписаниеОшибки());
				//Отказ = Истина;
				//ОтменитьТранзакцию();
				//Возврат;
			КонецПопытки;	
		КонецЕсли;
		
		Об.Разблокировать();
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Функция смартПолучитьНомерВерсииПоследний(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Максимум(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВерсииОбъектов.Объект";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НомерВерсии;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
Функция смартПроверитьВозникновениеОтрицательныхОстатков(смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,ПриПроведении=Ложь,Товары=Ложь)
	Запрос=Новый Запрос;	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ВходящиеДанные.Номенклатура КАК Номенклатура,
	|			ВходящиеДанные.Характеристика КАК Характеристика,
	|			ВходящиеДанные.Склад КАК Склад,
	|			ВходящиеДанные.Количество КАК Количество
	|		ПОМЕСТИТЬ ВТТовары
	|		ИЗ
	|			&ВТДанные КАК ВходящиеДанные
	|		;
    |
	|		////////////////////////////////////////////////////////////////////////////////
	|		ВЫБРАТЬ
	|			Набор.Номенклатура КАК Номенклатура,
	|			Набор.Характеристика КАК Характеристика,
	|			Набор.Склад КАК Склад,
	|			СУММА(Набор.Количество) КАК Количество
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГрафикПоступленияТоваровОбороты.Номенклатура КАК Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика КАК Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад КАК Склад,
	|				СУММА(ГрафикПоступленияТоваровОбороты.КоличествоИзЗаказовПриход) КАК Количество
	|			ИЗ
	|				РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикПоступленияТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикПоступленияТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикПоступленияТоваровОбороты.Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				СУММА(-1 * ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход)
	|			ИЗ
	|				РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикОтгрузкиТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикОтгрузкиТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Характеристика,
	|				ВТТовары.Склад,
	|				СУММА(ВТТовары.Количество)
	|			ИЗ
	|				ВТТовары КАК ВТТовары
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Склад,
	|				ВТТовары.Характеристика) КАК Набор
    |
	|		СГРУППИРОВАТЬ ПО
	|			Набор.Номенклатура,
	|			Набор.Характеристика,
	|			Набор.Склад
	|		ИМЕЮЩИЕ
	|		СУММА(Набор.Количество) < 0";
	Запрос.УстановитьПараметр("Регистратор",Этотобъект.Ссылка);

	смартТаблицаДляПроверкиОтрицательныхОстатков.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	Если Товары Тогда
		Для Каждого Стр Из смартТаблицаДляПроверкиОтрицательныхОстатков Цикл 
			КоличествоВСтр=0;
			Если ПриПроведении Тогда
				СтрокиТовары=ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));	
				Для Каждого СтрТовары Из СтрокиТовары Цикл
					Если НЕ СтрТовары.Отменено Тогда
						КоличествоВСтр=КоличествоВСтр+СтрТовары.Количество;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			Стр.Количество=КоличествоВСтр;				
		КонецЦикла;	
	Иначе
		Для Каждого Стр Из смартТаблицаДляПроверкиОтрицательныхОстатков Цикл 
			КоличествоВСтр=0;
			Если ПриПроведении Тогда
            	КоличествоВСтр=КоличествоВСтр+ЭтотОбъект.Количество;
			КонецЕсли;
			Стр.Количество=КоличествоВСтр;				
		КонецЦикла;	
	КонецЕсли;
	Запрос.УстановитьПараметр("ВТДанные",смартТаблицаДляПроверкиОтрицательныхОстатков);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда
		Отказ = Истина;
		Если ПриПроведении тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки: ");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки при отмене проведения / пометке на удаление документа: ");
		КонецЕсли;
		
		Для Каждого Стр Из Рез Цикл
			ТекстОшибки = "По номенклатуре """ + Строка(Стр.Номенклатура) + """";
			Если ЗначениеЗаполнено(Стр.Характеристика) тогда
				ТекстОшибки = ТекстОшибки + "(" + Строка(Стр.Характеристика) + ")";
			КонецЕсли;
			
			ТекстОшибки = ТекстОшибки + " возникает отрицательный остаток " + Формат(Стр.Количество ) + " " + Строка(Стр.Номенклатура.ЕдиницаИзмерения) + " по складу """ + Строка(Стр.Склад) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;	
	КонецЕсли;	
КонецФункции //-- #1333 смарт: Фролов 28.03.2023 

#КонецОбласти

#КонецЕсли
